Repository: maxshmax666/greenWave
Catalog: lib/l10n/intl_*.arb
Languages: ru

# navMap
source: Map
ru: Карта

# navLights
source: Lights
ru: Светофоры

# navSettings
source: Settings
ru: Настройки

source: Map
ru: Карта

source: Lights
ru: Светофоры

source: Settings
ru: Настройки

source: Sign in
ru: Войти

source: Sign up
ru: Зарегистрироваться

source: Create account
ru: Создать аккаунт

# haveAccount
source: I have an account
ru: У меня уже есть аккаунт

source: Password
ru: Пароль

# passwordLabel
source: Password
ru: Пароль

# emailHint
source: Enter your email
ru: Введите e‑mail

# passwordHint
source: Enter your password
ru: Введите пароль

# slogan
source: Ride the wave
ru: Лови волну зелёных

# lightsTitle
source: Lights
ru: Светофоры

# failedLoadLights
source: Failed to load lights: {error}
ru: Не удалось загрузить светофоры: {error}

source: no coords
ru: нет координат

# lightWithId
source: Light {id}
ru: Светофор {id}

# settingsTitle
source: Settings
ru: Настройки

source: Dark theme
ru: Тёмная тема

source: English
ru: Английский

source: Russian
ru: Русский

source: Language
ru: Язык

# routeError
source: Route error: {error}
ru: Ошибка маршрута: {error}

source: Light added
ru: Светофор добавлен

# addError
source: Add error: {error}
ru: Ошибка добавления: {error}

# explorerTooltip
source: Explorer
ru: Обзор

source: Refresh
ru: Обновить

# profileCar
source: Car
ru: Авто

# profileFoot
source: Foot
ru: Пешком

# profileBike
source: Bike
ru: Велосипед

# tileLoadError
source: Tile load error: {error}
ru: Ошибка загрузки тайлов: {error}

# speedAdvice
source: Go ~{speed} km/h
ru: Едьте ~{speed} км/ч

# notEnoughData
source: Not enough data. Ride with camera autolog.
ru: Недостаточно данных. Проедьте с авто‑логом камеры.

source: No lights on route
ru: На маршруте нет светофоров

# legendMinor
source: Minor
ru: Второстепенная

# legendMain
source: Main
ru: Главная

# legendPed
source: Pedestrians
ru: Пешеходы

source: Clear route
ru: Сбросить маршрут

source: My location
ru: Моё местоположение

source: Add light
ru: Добавить светофор

# cameraTitle
source: Camera — auto log
ru: Камера — авто‑лог

# roiInfo
source: ROI: tap frame • Color: {color}
ru: ROI: тап по кадру • Цвет: {color}

# noCameraPermission
source: No camera permission. Enable in settings.
ru: Нет разрешения на камеру. Включите в настройках.

# cameraNotFound
source: Camera not found on device.
ru: Камера не найдена на устройстве.

# cameraError
source: Camera error: {error}
ru: Ошибка камеры: {error}

# adviceTitle
source: Speed advice
ru: Совет по скорости

# cycleInfo
source: Cycle {cycle}s (R {red} / Y {yellow} / G {green})
ru: Цикл {cycle}с (К {red} / Ж {yellow} / З {green})

# holdSpeed
source: Keep ~{low}–{high} km/h
ru: Держите ~{low}–{high} км/ч

# unitsKmh
source: Units
ru: Единицы

# roadSpeedLimit
source: Road speed limit (km/h)
ru: Ограничение скорости (км/ч)

# cameraOffset
source: Camera clock offset (s)
ru: Смещение часов камеры (с)

# jerkStep
source: Advisor jerk step
ru: Шаг изменения совета
